#include <stdio.h>

#define ·̣
#define ·̣·̣
#define ·̣·̣·̣·̣
#define ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣
#define ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣ {
#define ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣
#define ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣ 
#define ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣ }

·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣ int main() ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣
·̣                                       ·̣
·̣  ·̣·̣·̣·̣ for (int i= 1; i<=100; i++) ·̣·̣  ·̣ 
·̣  ·̣                                 ·̣  ·̣
·̣  ·̣    ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣     ·̣  ·̣
·̣  ·̣    ·̣  i%15? i%3? i%5?     ·̣     ·̣  ·̣
·̣  ·̣    ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣     ·̣  ·̣
·̣  ·̣    ·̣  printf("%d ", i)    :     ·̣  ·̣
·̣  ·̣    ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣     ·̣  ·̣
·̣  ·̣    ·̣  printf("Buzz ")     :     ·̣  ·̣
·̣  ·̣    ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣     ·̣  ·̣
·̣  ·̣    ·̣  printf("Fizz ")     :     ·̣  ·̣
·̣  ·̣    ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣     ·̣  ·̣
·̣  ·̣    ·̣  printf("FizzBuzz ") ;     ·̣  ·̣
·̣  ·̣    ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣     ·̣  ·̣
·̣  ·̣                                 ·̣  ·̣              
·̣  ·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣  ·̣
·̣                                       ·̣
·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣·̣
